package com.ds.gzl;

/**
 * @author ds
 * @date 2026/5/12
 * @description
 */
public class Test260512 {
    public static void main(String[] args) {
        for (String s : str().split("\n")) {
            System.out.println(s);
            System.out.println(s.replace("日志追溯改造", "加解密功能改造"));
            System.out.println(s.replace("日志追溯改造", "数据权限管控功能改造"));
        }
    }

    private static String str() {
        return "后端：ESB移动端登录接口日志追溯改造\n" +
                "后端：ESB公司部功能接口日志追溯改造\n" +
                "后端：ESB网贷关联方功能接口日志追溯改造\n" +
                "后端：ESB借款人关联方信息同步接口日志追溯改造\n" +
                "后端：ESB借款人及其担保人的存款和交易流水同步接口日志追溯改造\n" +
                "后端：ESB不良客户的密切关联方同步接口日志追溯改造\n" +
                "后端：ESB股权关联图谱接口日志追溯改造\n" +
                "后端：ESB查询企业命中担保圈链汇总接口日志追溯改造\n" +
                "后端：ESB查询企业命中担保链圈一度关联关系接口日志追溯改造\n" +
                "后端：ESB查询公司关联担保对象名单列表接口日志追溯改造\n" +
                "后端：ESB查询企业和企业关联担保对象之间关联详情图谱接口日志追溯改造\n" +
                "后端：ESB图谱标签接口日志追溯改造\n" +
                "后端：ESB查询受托支付监控信号接口日志追溯改造\n" +
                "后端：ESB根据查询流水号查询监控信号详情接口日志追溯改造\n" +
                "后端：ESB工作单位校验接口日志追溯改造接口日志追溯改造\n" +
                "后端：ESB对公客户信贷资金回流接口日志追溯改造\n" +
                "后端：ESB对公客户信贷资金挪用接口日志追溯改造\n" +
                "后端：ESB接收授权推送信息接口日志追溯改造\n" +
                "后端：ESB免密登录接口日志追溯改造\n" +
                "后端：ESB批量查询接口日志追溯改造\n" +
                "后端：ESB获取企业客户的关联关系接口日志追溯改造\n" +
                "后端：ESB获取负面舆情接口日志追溯改造\n" +
                "后端：ESB好企贷功能接口日志追溯改造\n" +
                "后端：ESB查询复杂关系探测信号接口日志追溯改造\n" +
                "后端：ESB根据查询流水号查询复杂关系探测信号详情接口日志追溯改造\n" +
                "后端：ESB风铃智评小微反欺诈需求接口日志追溯改造\n" +
                "后端：ESB小微反欺诈结果查询接口日志追溯改造\n" +
                "后端：ESB信贷大中尽调创建任务接口日志追溯改造\n" +
                "后端：ESB风铃智评关联接入风险预警体系接口日志追溯改造\n" +
                "后端：行业大中专精企业尽调查询基本信息接口日志追溯改造\n" +
                "后端：行业大中专精企业尽调查询股东信息接口日志追溯改造\n" +
                "后端：行业大中专精企业尽调查询企业关联企业接口日志追溯改造\n" +
                "后端：行业大中专精企业尽调查询工商变更接口日志追溯改造\n" +
                "后端：行业大中专精企业尽调查询裁判文书列表接口日志追溯改造\n" +
                "后端：行业大中专精企业尽调查询开庭公告接口日志追溯改造\n" +
                "后端：行业大中专精企业尽调查询法院公告接口日志追溯改造\n" +
                "后端：行业大中专精企业尽调查询行政处罚接口日志追溯改造\n" +
                "后端：行业批量查询用户权接口日志追溯改造\n" +
                "后端：行业单个查询用户权限接口日志追溯改造\n" +
                "后端：外包管理平台查询基本信息接口日志追溯改造\n" +
                "后端：外包管理平台查询法务关注接口日志追溯改造\n" +
                "后端：外包管理平台根据统一社会信用代码查询返回公司名接口日志追溯改造\n" +
                "后端：外部数据查询供应商分析查询基本信息接口日志追溯改造\n" +
                "后端：外部数据查询供应商分析查询风险关注接口日志追溯改造\n" +
                "后端：外部数据查询供应商分析查询监管风险接口日志追溯改造\n" +
                "后端：招采系统查询基本信息接口日志追溯改造\n" +
                "后端：招采系统查询法务关注接口日志追溯改造\n" +
                "后端：招采系统多方找关系接口日志追溯改造\n" +
                "后端：运营内控资金圈统计需求汇总信息统计接口日志追溯改造\n" +
                "后端：运营内控资金圈统计需求资金圈开户机构分布接口日志追溯改造\n" +
                "后端：运营内控资金圈统计需求资金圈列表接口日志追溯改造\n" +
                "后端：运营内控资金圈统计需求资金圈详情接口日志追溯改造\n" +
                "后端：运营内控资金圈统计需求根据族谱名查询资金圈企业族谱接口日志追溯改造\n" +
                "后端：运营内控资金圈统计需求查询资金圈企业族谱边详情接口日志追溯改造\n" +
                "后端：移动展业查询员工映射并返回对应权限接口日志追溯改造\n" +
                "后端：移动展业总体统计接口日志追溯改造\n" +
                "后端：移动展业投放机构接口日志追溯改造\n" +
                "后端：移动展业明细列表接口日志追溯改造\n" +
                "后端：移动展业六大产业集群接口日志追溯改造\n" +
                "后端：移动展业产业投放机构接口日志追溯改造\n" +
                "后端：移动展业十大功能平台列表接口日志追溯改造\n" +
                "后端：移动展业十大功能平台统计页接口日志追溯改造\n" +
                "后端：移动展业获取所有的下拉配置接口日志追溯改造\n" +
                "后端：移动展业查询公司关联关系接口日志追溯改造\n" +
                "后端：反洗钱图谱查询单一命中企业族谱接口日志追溯改造\n" +
                "后端：反洗钱图谱查询单一命中特征统计接口日志追溯改造\n" +
                "后端：反洗钱图谱查询边数据接口日志追溯改造\n" +
                "后端：反洗钱图谱根据族谱名获取公司列表接口日志追溯改造\n" +
                "后端：反洗钱图谱开户时间、地点分布接口日志追溯改造\n" +
                "后端：反洗钱图谱反洗钱地址分布接口日志追溯改造\n" +
                "后端：反洗钱免密登录接口日志追溯改造\n" +
                "后端：网贷查询受托支付流水接口日志追溯改造\n" +
                "后端：财务慧识获取违约企业名单接口日志追溯改造\n" +
                "后端：金租两家企业找关系接口日志追溯改造\n" +
                "后端：金租两家股权关系详情接口日志追溯改造\n" +
                "后端：金租公司校验接口日志追溯改造\n" +
                "后端：信贷两家企业找关系接口日志追溯改造\n" +
                "后端：网贷好企贷功能查询接口日志追溯改造\n" +
                "后端：区块连通知接口日志追溯改造\n" +
                "后端：区块链查询接口日志追溯改造";
    }

}
