package com.ds.gzl;

/**
 * @author ds
 * @date 2025/2/19
 * @description
 */
public class Test01 {
    public static void main(String[] args) {
        String str = "前端：报告一键生成公司类贷款模版基本信息模块预览开发\t1\n" +
                "前端：报告一键生成公司类贷款模版行业分析模块预览开发\t1\n" +
                "前端：报告一键生成公司类贷款模版财务分析模块预览开发\t1\n" +
                "前端：报告一键生成公司类贷款模版外部风险分析模块预览开发\t1\n" +
                "前端：报告一键生成公司类贷款模版有息负债分析模块预览开发\t1\n" +
                "前端：报告一键生成公司类贷款模版流动资金测算模块预览开发\t1\n" +
                "前端：报告一键生成公司类贷款模版还款来源分析模块预览开发\t1\n" +
                "前端：报告一键生成公司类贷款模版保证担保能力分析模块预览开发\t1\n" +
                "前端：报告一键生成公司类贷款模版结算分析模块预览开发\t1\n" +
                "前端：报告一键生成公司类贷款模版下载pdf开发\t2\n" +
                "前端：报告一键生成小微企业贷款模版基本信息模块预览开发\t1\n" +
                "前端：报告一键生成小微企业贷款模版行业分析模块预览开发\t1\n" +
                "前端：报告一键生成小微企业贷款模版财务分析模块预览开发\t1\n" +
                "前端：报告一键生成小微企业贷款模版外部风险分析模块预览开发\t1\n" +
                "前端：报告一键生成小微企业贷款模版有息负债分析模块预览开发\t1\n" +
                "前端：报告一键生成小微企业贷款模版流动资金测算模块预览开发\t1\n" +
                "前端：报告一键生成小微企业贷款模版还款来源分析模块预览开发\t1\n" +
                "前端：报告一键生成小微企业贷款模版保证担保能力分析模块预览开发\t1\n" +
                "前端：报告一键生成小微企业贷款模版结算分析模块预览开发\t1\n" +
                "前端：报告一键生成小微企业贷款模版下载pdf开发\t2\n" +
                "前端：报告一键生成个人经营贷款模版基本信息模块预览开发\t1\n" +
                "前端：报告一键生成个人经营贷款模版行业分析模块预览开发\t1\n" +
                "前端：报告一键生成个人经营贷款模版财务分析模块预览开发\t1\n" +
                "前端：报告一键生成个人经营贷款模版外部风险分析模块预览开发\t1\n" +
                "前端：报告一键生成个人经营贷款模版有息负债分析模块预览开发\t1\n" +
                "前端：报告一键生成个人经营贷款模版流动资金测算模块预览开发\t1\n" +
                "前端：报告一键生成个人经营贷款模版还款来源分析模块预览开发\t1\n" +
                "前端：报告一键生成个人经营贷款模版保证担保能力分析模块预览开发\t1\n" +
                "前端：报告一键生成个人经营贷款模版结算分析模块预览开发\t1\n" +
                "前端：报告一键生成个人经营贷款模版下载pdf开发\t2\n" +
                "前端：报告一键生成房地产开发贷款模版基本信息模块预览开发\t1\n" +
                "前端：报告一键生成房地产开发贷款模版行业分析模块预览开发\t1\n" +
                "前端：报告一键生成房地产开发贷款模版财务分析模块预览开发\t1\n" +
                "前端：报告一键生成房地产开发贷款模版外部风险分析模块预览开发\t1\n" +
                "前端：报告一键生成房地产开发贷款模版有息负债分析模块预览开发\t1\n" +
                "前端：报告一键生成房地产开发贷款模版流动资金测算模块预览开发\t1\n" +
                "前端：报告一键生成房地产开发贷款模版还款来源分析模块预览开发\t1\n" +
                "前端：报告一键生成房地产开发贷款模版保证担保能力分析模块预览开发\t1\n" +
                "前端：报告一键生成房地产开发贷款模版结算分析模块预览开发\t1\n" +
                "前端：报告一键生成房地产开发贷款模版下载pdf开发\t2\n" +
                "前端：报告一键生成固定资产贷款模版基本信息模块预览开发\t1\n" +
                "前端：报告一键生成固定资产贷款模版行业分析模块预览开发\t1\n" +
                "前端：报告一键生成固定资产贷款模版财务分析模块预览开发\t1\n" +
                "前端：报告一键生成固定资产贷款模版外部风险分析模块预览开发\t1\n" +
                "前端：报告一键生成固定资产贷款模版有息负债分析模块预览开发\t1\n" +
                "前端：报告一键生成固定资产贷款模版流动资金测算模块预览开发\t1\n" +
                "前端：报告一键生成固定资产贷款模版还款来源分析模块预览开发\t1\n" +
                "前端：报告一键生成固定资产贷款模版保证担保能力分析模块预览开发\t1\n" +
                "前端：报告一键生成固定资产贷款模版结算分析模块预览开发\t1\n" +
                "前端：报告一键生成固定资产贷款模版下载pdf开发\t2\n" +
                "前端：报告一键生成银团贷款模版基本信息模块预览开发\t1\n" +
                "前端：报告一键生成银团贷款模版行业分析模块预览开发\t1\n" +
                "前端：报告一键生成银团贷款模版财务分析模块预览开发\t1\n" +
                "前端：报告一键生成银团贷款模版外部风险分析模块预览开发\t1\n" +
                "前端：报告一键生成银团贷款模版有息负债分析模块预览开发\t1\n" +
                "前端：报告一键生成银团贷款模版流动资金测算模块预览开发\t1\n" +
                "前端：报告一键生成银团贷款模版还款来源分析模块预览开发\t1\n" +
                "前端：报告一键生成银团贷款模版保证担保能力分析模块预览开发\t1\n" +
                "前端：报告一键生成银团贷款模版结算分析模块预览开发\t1\n" +
                "前端：报告一键生成银团贷款模版下载pdf开发\t2\n";

        String[] list = str.split("\n");
        for (String s : list) {
            System.out.println(s);
            System.out.println(s.replace("前端：", "后端：").replace("预览开发", "预览功能开发"));
        }

    }
}
